<a href="https://colab.research.google.com/github/NishaimLimbu/classes/blob/main/Welcome_To_Colab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
data = {
  'Name' : ["Alice", "Bob", "Charlie"],
 'Age' : [25, 30, 35],
 'City' : ["New York", "Los Angeles", "Chicago"]
}
df1=pd.DataFrame(data)
print ("pandas DataFrame: ")
print (df1)

pandas DataFrame:
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [2]:
data = [10,20,30,40,50]
series=pd.Series(data)
print ("pandas Series: ")
print (series)

pandas Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
dataa = {
  'name' : ["Alice", "Bob", "Charlie"],
  'marks' : [90, 85, 95]
}
df2 = pd.DataFrame(dataa)
print ("pandas DataFrame: ")
print (df2)

pandas DataFrame:
      name  marks
0    Alice     90
1      Bob     85
2  Charlie     95

.dropna() is used to remove all the data which have null values in it.
.fillna() is used to fill up allt he data which have null values with given value inside ()
.drop_duplicate() is used to remove all the duplicate data in the table data.

In [13]:
data={
  'name':['Alice','Bob', None,'Alice'],
  'Age' : [25, 30, 35,25],
  'marks' : [90, None, 95,90],
  'phone' : [989789944,98999545,None,989789944]
}
data1=pd.DataFrame(data)
print (data1,"\n")
clean_df=data1.dropna()
print (clean_df,'\n')
filled_df=data1.fillna(0)
print (filled_df,"\n")
remove_dup = data1.drop_duplicates()
print (remove_dup)

    name  Age  marks        phone
0  Alice   25   90.0  989789944.0
1    Bob   30    NaN   98999545.0
2   None   35   95.0          NaN
3  Alice   25   90.0  989789944.0

    name  Age  marks        phone
0  Alice   25   90.0  989789944.0
3  Alice   25   90.0  989789944.0

    name  Age  marks        phone
0  Alice   25   90.0  989789944.0
1    Bob   30    0.0   98999545.0
2      0   35   95.0          0.0
3  Alice   25   90.0  989789944.0

    name  Age  marks        phone
0  Alice   25   90.0  989789944.0
1    Bob   30    NaN   98999545.0
2   None   35   95.0          NaN

In [38]:
dataa = {
  'name' : ["Alice", "Bob", "Charlie"],
  'marks' : [90, 85, 95]
}
dif_name=pd.DataFrame(dataa)
print (dif_name,"\n")
dif_name.rename(columns = {'name':'Studnet_Name'}, inplace=True)
print (dif_name)

      name  marks
0    Alice     90
1      Bob     85
2  Charlie     95

  Studnet_Name  marks
0        Alice     90
1          Bob     85
2      Charlie     95

In [47]:
data = {
  'name':['raju','ram','hari','seri','alice','anup'],
  'age':[45,19,41,32,65,12],
  'address':['NY','AF','WDC','NY','AL',"AF"]
}
df=pd.DataFrame(data)
print(df,"\n")
adults= df (df('age'>18))
print ("adult")
print (adults)

    name  age address
0   raju   45      NY
1    ram   19      AF
2   hari   41     WDC
3   seri   32      NY
4  alice   65      AL
5   anup   12      AF

TypeError: '>' not supported between instances of 'str' and 'int'